cats_rental/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "birthdate", "color", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["description", "He likes to watch birds and poop on the rug."], ["updated_at", "2020-01-03 21:43:27.465461"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)